//奖项类型，1 表示奖项不分等级，不限数量，2 表示奖项分等级，限制每个等级的数量
const awardsType = 2

//奖项类型是1的时候，使用此配置
var globalkeys = [
	"不如买吃的",
	"再刮是狗！",
	"狗都不刮！",
	"圣手"
];
//奖项类型是2的时候，使用此配置
var globalkeys2 = {
	"💕": {
		"awards": "樱花园门票两张",
		"num": 1
	},
	"✨": {
		"awards": "足金项链",
		"num": 1
	},
	"❤": {
		"awards": "安康",
		"num": 35
	},
	"🎁": {
		"awards": "欧皇的祝福！",
		"num": 20
	},	
	"🧡": {
		"awards": "平安",
		"num": 10
	},	
	"🧨": {
		"awards": "团园",
		"num": 20
	},
	"💗": {
		"awards": "和睦",
		"num": 10
	},
	"🍭": {
		"awards": "20元",
		"num": 5
	},
	"🎉": {
		"awards": "50元",
		"num": 1
	},
	"🥵": {
		"awards": "满10减2",
		"num": 50
	},
	"😍": {
		"awards": "满49减20！",
		"num": 2
	},
	"💓": {
		"awards": "富贵",
		"num": 20
	},
	"🥱": {
		"awards": "不如买吃的",
		"num": 30
	},				
	"🏆": {
		"awards": "有请圣手！",
		"num": 1
	},	
	"🤬": {
		"awards": "再刮是狗！",
		"num": 5
	},
	"🌈": {
		"awards": "好运来！",
		"num": 1
	},
	"1️⃣8️⃣": {
		"awards": "第十八张",
		"num": 1
	},			
	"😂": {
		"awards": "狗都不刮！",
		"num": 20
	}
};